[
  {
    "id": 1,
    "name": "Matcha and Hojicha Cookies",
    "description": "Soft and chewy homemade hojicha cookies",
    "ingredients": [
      { "quantity": "110 g", "item": "butter (softened)" },
      { "quantity": "200 g", "item": "sugar" },
      { "quantity": "1", "item": "egg" },
      { "quantity": "1 tsp", "item": "vanilla extract" },
      { "quantity": "200 g", "item": "all purpose flour" },
      { "quantity": "1/2 tsp", "item": "baking powder" },
      { "quantity": "1/2 tsp", "item": "baking soda" },
      { "quantity": "3/4 tbsp", "item": "hojicha powder" },
      { "quantity": "3/4 tbsp", "item": "matcha powder" },
      { "quantity": "1/2 tsp", "item": "salt" }
    ],
    "instructions": [
      "Use a hand mixer to whisk together softened butter with sugar until light and fluffy.",
      "Add egg and vanilla extract and mix until combined.",
      "Seperate the wet ingredients into two sections. In one section, add half of the wet ingredients to one bowl. Add the rest of the wet ingredients to a seperate bowl.",
      "In a another bowl, sift and/or whisk together flour, baking powder, baking soda, and salt.",
      "Seperate the dry ingredients into two sections. In one section, add the hojicha powder and in the other section, add the matcha powder. Whisk until homogenous.",
      "Add dry ingredients in sections to the wet ingredients and mix until just combined. You should now have two different doughs: hojicha and matcha.",
      "Make ~40-50g dough chunks and roll them into balls.",
      "Place the balls on a tray lined with parchment paper or a silicone baking mat. Flatten slightly.",
      "Place the prepared cookies in the fridge for at least 30 minutes.",
      "Preheat oven to 355°F and bake the cookies for 12 minutes."
    ],
    "tags": ["Matcha", "Hojicha", "Cookies"],
    "prepTime": 30,
    "cookTime": 12,
    "image": "matchahojichacookies.jpg",
    "images": ["placeholder.jpg", "placeholder2.jpg", "placeholder3.jpg"]
  },
  {
    "id": 2,
    "name": "Matcha and Hojicha Macarons",
    "description": "TBD",
    "ingredients": [
      { "quantity": "75 g", "item": "almond flour" },
      { "quantity": "75 g", "item": "powdered sugar" },
      { "quantity": "4 g", "item": "matcha or hojicha powder" },
      { "quantity": "70 g", "item": "egg whites" },
      { "quantity": "60 g", "item": "granulated sugar" },
      { "quantity": "2", "item": "egg yolks" },
      { "quantity": "50 g", "item": "granulated sugar" },
      { "quantity": "30 ml", "item": "water" },
      { "quantity": "100 g", "item": "butter (softened)" },
      { "quantity": "3 g", "item": "matcha or hojicha powder" }
    ],
    "instructions": [
      "Use a blender or food processor to combine almond flour, powdered sugar, and matcha or hojicha powder. Blend until fine.",
      "Sift contents into a bowl. Be sure to only use the fine powder and discard any larger bits.",
      "In a seperate bowl using a hand mixer, whisk egg whites until foamy.",
      "Once foamy, gradually add granulated sugar in sections and continue whisking until stiff peaks form. You've now made your meringue.",
      "Add your dry mix to the meringue in sections. Use a spatula to fold the mixture until it reaches a thick, lava-like consistency.",
      "Put your mixture into a piping bag and pipe small circles onto a baking tray lined with a silicone baking mat.",
      "Be sure to tap the tray on the counter a few times to release any air bubbles. Let the small circles sit at room temperature until a skin forms on the surface. You should be able to lightly touch the surface without any batter sticking to your finger.",
      "Preheat oven to 285°F and bake the cookies for 12 minutes.",
      "While the cookies are baking, begin making the buttercream filling. In a bowl using a hand mixer, whisk egg yolks until light and fluffy.",
      "In a small saucepan, combine granulated sugar and water. Heat until the sugar dissolves.",
      "With the mixer on low, slowly pour the sugar syrup into the egg yolks. Once combined, increase the mixer speed to high and whisk until the mixture has cooled to room temperature.",
      "Add softened butter in sections and continue whisking until smooth. Once smooth, add matcha or hojicha powder and whisk until fully combined.",
      "Once the cookies have cooled, pair them up based on similar sizes.",
      "Pipe the buttercream filling onto one cookie and sandwich it with the other cookie."
    ],
    "tags": ["Matcha", "Hojicha"],
    "prepTime": 40,
    "cookTime": 12,
    "image": "matchamacarons.jpg",
    "images": ["placeholder.jpg", "placeholder2.jpg", "placeholder3.jpg"]
  }
]
